{
    "format": "layers-model",
    "generatedBy": "TensorFlow.js v4.12.0",
    "convertedBy": "TensorFlow.js Converter v4.12.0",
    "modelTopology": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential_1",
        "layers": [
          {
            "class_name": "Dense",
            "config": {
              "units": 128,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotNormal",
                "config": {}
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null,
              "name": "dense_1",
              "trainable": true,
              "batch_input_shape": [null, 50],
              "dtype": "float32"
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "rate": 0.3,
              "noise_shape": null,
              "seed": null,
              "name": "dropout_1",
              "trainable": true
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "units": 64,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotNormal",
                "config": {}
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null,
              "name": "dense_2",
              "trainable": true
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "rate": 0.2,
              "noise_shape": null,
              "seed": null,
              "name": "dropout_2",
              "trainable": true
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "units": 504,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {}
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null,
              "name": "dense_3",
              "trainable": true
            }
          }
        ]
      },
      "keras_version": "2.12.0",
      "backend": "tensorflow"
    },
    "weightsManifest": [
      {
        "paths": ["./weights.bin"],
        "weights": [
          {
            "name": "dense_1/kernel",
            "shape": [50, 128],
            "dtype": "float32"
          },
          {
            "name": "dense_1/bias",
            "shape": [128],
            "dtype": "float32"
          },
          {
            "name": "dense_2/kernel",
            "shape": [128, 64],
            "dtype": "float32"
          },
          {
            "name": "dense_2/bias",
            "shape": [64],
            "dtype": "float32"
          },
          {
            "name": "dense_3/kernel",
            "shape": [64, 504],
            "dtype": "float32"
          },
          {
            "name": "dense_3/bias",
            "shape": [504],
            "dtype": "float32"
          }
        ]
      }
    ]
  }